 var datas=new Array
[
    [
        {
            "name": "我浪漫并富于幻想",
            "value": "e"
        },
        {
            "name": "我很实际并实事求是",
            "value": "b"
        }
    ],
    [
        {
            "name": "我倾向于接受冲突",
            "value": "g"
        },
        {
            "name": "我倾向于避免冲突",
            "value": "a"
        }
    ],
    [
        {
            "name": "我一般是老练的、有魅力的以及有上进心",
            "value": "c"
        },
        {
            "name": "我一般是直率的、刻板的以及空想的",
            "value": "e"
        }
    ],
    [
        {
            "name": "我倾向于集中注意某一事物时，容易紧张",
            "value": "h"
        },
        {
            "name": "我倾向于自然的东西，喜欢开玩笑",
            "value": "i"
        }
    ],
    [
        {
            "name": "我待人友好，愿意结交新朋友",
            "value": "f"
        },
        {
            "name": "我喜欢独处，不太愿意与人交往",
            "value": "e"
        }
    ],
    [
        {
            "name": "我很难放松和停止思考潜在的问题",
            "value": "b"
        },
        {
            "name": "潜在的问题不会影响我的工作",
            "value": "a"
        }
    ],
    [
        {
            "name": "我是“聪明”的生存者",
            "value": "g"
        },
        {
            "name": "我是“高尚”的理想主义者",
            "value": "d"
        }
    ],
    [
        {
            "name": "我需要给别人爱",
            "value": "e"
        },
        {
            "name": "我愿意与别人保持一定的距离",
            "value": "g"
        }
    ],
    [
        {
            "name": "当别人给我一项新任务时，我通常会问自己它是否对我有用",
            "value": "c"
        },
        {
            "name": "当别人给我一项新任务时，我通常会问自己是否有兴趣",
            "value": "i"
        }
    ],
    [
        {
            "name": "我倾向于关注自己",
            "value": "e"
        },
        {
            "name": "我倾向于关注他人",
            "value": "a"
        }
    ],
    [
        {
            "name": "别人依赖我的见识与知识",
            "value": "h"
        },
        {
            "name": "别人依赖我的力量与决策",
            "value": "g"
        }
    ],
    [
        {
            "name": "我给人的印象是十分不自信的",
            "value": "b"
        },
        {
            "name": "我给人的印象是十分自信的",
            "value": "d"
        }
    ],
    [
        {
            "name": "我更加注重关系",
            "value": "f"
        },
        {
            "name": "我更加注意目的",
            "value": "c"
        }
    ],
    [
        {
            "name": "我不能大胆地说出自己想说的话",
            "value": "e"
        },
        {
            "name": "我能大胆地说出别人想说但没敢说的话",
            "value": "i"
        }
    ],
    [
        {
            "name": "不考虑其他选择而做某一确定的事对我来说是很困难的",
            "value": "h"
        },
        {
            "name": "放松、更具灵活性对我来说是很困难的",
            "value": "d"
        }
    ],
    [
        {
            "name": "我一般犹豫与拖延",
            "value": "b"
        },
        {
            "name": "我一般大胆与果断",
            "value": "g"
        }
    ],
    [
        {
            "name": "我不愿意别人给我带来麻烦",
            "value": "a"
        },
        {
            "name": "我被别人依赖，让我帮忙解决麻烦",
            "value": "f"
        }
    ],
    [
        {
            "name": "通常我会为了完成工作将感情置之不顾",
            "value": "c"
        },
        {
            "name": "在做事之前我需要克制自己的感情",
            "value": "e"
        }
    ],
    [
        {
            "name": "我一般是讲求方法并且很谨慎的",
            "value": "b"
        },
        {
            "name": "我一般是敢于冒险的",
            "value": "e"
        }
    ],
    [
        {
            "name": "我倾向于帮助和给予，喜欢与他人在一起",
            "value": "f"
        },
        {
            "name": "我倾向于严肃与缄默，喜欢讨论问题",
            "value": "d"
        }
    ],
    [
        {
            "name": "我常常感到自己需要成为顶梁柱",
            "value": "g"
        },
        {
            "name": "我常常感到自己需要做的十全十美",
            "value": "c"
        }
    ],
    [
        {
            "name": "我喜欢问难题和保持独立性",
            "value": "g"
        },
        {
            "name": "我喜欢保持心理的稳定与平静",
            "value": "a"
        }
    ],
    [
        {
            "name": "我太顽固并保持怀疑的态度",
            "value": "b"
        },
        {
            "name": "我太软心肠并多愁善感",
            "value": "f"
        }
    ],
    [
        {
            "name": "我常常担心自己不能得到较好的东西",
            "value": "i"
        },
        {
            "name": "我常常担心如果自己放松警惕，别人就会欺骗我",
            "value": "g"
        }
    ],
    [
        {
            "name": "我习惯性表现得很冷淡而使别人生气",
            "value": "e"
        },
        {
            "name": "我习惯性指使别人做事而使他们生气",
            "value": "d"
        }
    ],
    [
        {
            "name": "如果有太多的刺激和鼓舞，我会感到忧虑",
            "value": "a"
        },
        {
            "name": "如果没有太多的刺激和鼓舞，我会感到忧虑",
            "value": "i"
        }
    ],
    [
        {
            "name": "我要依靠朋友，同时他们也可以依靠我",
            "value": "b"
        },
        {
            "name": "我不依靠别人独立行事",
            "value": "c"
        }
    ],
    [
        {
            "name": "我一般独立于专心",
            "value": "h"
        },
        {
            "name": "我一般情绪化并热衷于自己的想法",
            "value": "e"
        }
    ],
    [
        {
            "name": "我喜欢向别人提出挑战，使他们振奋起来",
            "value": "g"
        },
        {
            "name": "我一般是敢于冒险的",
            "value": "f"
        }
    ],
    [
        {
            "name": "我总的来说是个开朗并喜欢交际的人",
            "value": "i"
        },
        {
            "name": "我总的来说是个认真并能很自律的人",
            "value": "d"
        }
    ],
    [
        {
            "name": "我希望能迎合别人-当别人距离很远，我就会感到不舒服",
            "value": "a"
        },
        {
            "name": "我希望与众不同-当不能看到别人与自己的区别，我就感到不舒服",
            "value": "c"
        }
    ],
    [
        {
            "name": "对我来说，追求个人的兴趣比追求舒适与安全更重要",
            "value": "h"
        },
        {
            "name": "对我来说，追求舒适比追求个人的兴趣更为重要",
            "value": "b"
        }
    ],
    [
        {
            "name": "当与他人有冲突时，我倾向于退缩",
            "value": "e"
        },
        {
            "name": "当与他人有冲突时，我很少会改变自己的态度",
            "value": "g"
        }
    ],
    [
        {
            "name": "我很容易屈服并受他人摆布",
            "value": "a"
        },
        {
            "name": "我对他人不但不作出让步，而且还对他们下达命令",
            "value": "d"
        }
    ],
    [
        {
            "name": "我很赏识自己高昂的精神状态与深沉",
            "value": "i"
        },
        {
            "name": "我很赏识自己对他人深沉的关心与热情",
            "value": "f"
        }
    ],
    [
        {
            "name": "我很想给别人留下好的印象",
            "value": "c"
        },
        {
            "name": "我并不在乎要给别人留下好的印象",
            "value": "h"
        }
    ],
    [
        {
            "name": "我依赖自己的毅力与常有的感觉",
            "value": "b"
        },
        {
            "name": "我依赖自己的想象与瞬间的灵感",
            "value": "e"
        }
    ],
    [
        {
            "name": "总的来说，我是很随和和很可爱的",
            "value": "a"
        },
        {
            "name": "总的来说，我是精力旺盛和过分自信的",
            "value": "g"
        }
    ],
    [
        {
            "name": "我努力工作以得到别人的接受与喜欢",
            "value": "c"
        },
        {
            "name": "能否得到别人的接受与喜欢对我来说并不重要",
            "value": "d"
        }
    ],
    [
        {
            "name": "当别人给我压力时我更容易退缩",
            "value": "h"
        },
        {
            "name": "当别人给我压力时我会变得更加自信",
            "value": "i"
        }
    ],
    [
        {
            "name": "人们对我感兴趣是因为我很开朗，有吸引力，有趣",
            "value": "f"
        },
        {
            "name": "人们对我感兴趣是因为我很安静，不同寻常，深沉",
            "value": "e"
        }
    ],
    [
        {
            "name": "职责与责任对我来说很重要",
            "value": "b"
        },
        {
            "name": "协调与认可对我来说很重要",
            "value": "a"
        }
    ],
    [
        {
            "name": "我制定出重要的计划并作出承诺以此鼓励人们",
            "value": "g"
        },
        {
            "name": "我指出不按照我们的建议去做所产生的后果，以此来要求人们顺从",
            "value": "d"
        }
    ],
    [
        {
            "name": "我很少表露情绪",
            "value": "h"
        },
        {
            "name": "我经常表露情绪",
            "value": "f"
        }
    ],
    [
        {
            "name": "我不擅长处理琐碎的事",
            "value": "i"
        },
        {
            "name": "我擅长处理琐碎的事",
            "value": "c"
        }
    ],
    [
        {
            "name": "我常常强调自己与绝大多数人的不同之处，尤其是家境的不同之处",
            "value": "e"
        },
        {
            "name": "我常常强调与绝大多数人的共同之处，尤其是家境的共同之处",
            "value": "a"
        }
    ],
    [
        {
            "name": "当场面变得热闹起来时，我倾向于站在一旁",
            "value": "h"
        },
        {
            "name": "当场面变得热闹起来时，我倾向于加入其中",
            "value": "g"
        }
    ],
    [
        {
            "name": "即使朋友不对，我也会支持他们",
            "value": "b"
        },
        {
            "name": "我不想为了友情对正确的事情作妥协",
            "value": "d"
        }
    ],
    [
        {
            "name": "我是一个善意的支持者",
            "value": "f"
        },
        {
            "name": "我是一个积极的老手",
            "value": "c"
        }
    ],
    [
        {
            "name": "当遇到困难时我倾向于夸大我的问题",
            "value": "e"
        },
        {
            "name": "当遇到困难时我倾向于转移注意力",
            "value": "i"
        }
    ],
    [
        {
            "name": "总的来说，我很确信知道情况应该如何",
            "value": "d"
        },
        {
            "name": "总的来说，我对情况持怀疑的态度",
            "value": "h"
        }
    ],
    [
        {
            "name": "我的悲观、抱怨会给别人带来麻烦",
            "value": "b"
        },
        {
            "name": "我的老板式的、控制的方式会给别人带来麻烦",
            "value": "g"
        }
    ],
    [
        {
            "name": "我倾向于按我的感觉办事并听之任之",
            "value": "f"
        },
        {
            "name": "我倾向于不按照我的感觉办事以免产生更多的问题",
            "value": "a"
        }
    ],
    [
        {
            "name": "通常我成为注意的焦点时，会很自然",
            "value": "c"
        },
        {
            "name": "通常我成为注意的焦点时，会很不习惯",
            "value": "e"
        }
    ],
    [
        {
            "name": "我做事情很谨慎，努力为意料之外的事情做准备",
            "value": "b"
        },
        {
            "name": "我做事情凭一时冲动，只是在问题出现时才临时准备",
            "value": "i"
        }
    ],
    [
        {
            "name": "当别人不是很欣赏我为他们所做的事情时我会很生气",
            "value": "f"
        },
        {
            "name": "当别人不听我说时我会很生气",
            "value": "d"
        }
    ],
    [
        {
            "name": "独立、自立更生对我很重要",
            "value": "g"
        },
        {
            "name": "有价值、得到别人的称赞对我很重要",
            "value": "c"
        }
    ],
    [
        {
            "name": "当与朋友争论时我倾向于强烈地坚持自己的观点",
            "value": "h"
        },
        {
            "name": "当与朋友争论时我倾向于顺其自然以免伤了和气",
            "value": "a"
        }
    ],
    [
        {
            "name": "我常常占有所爱的人——我不能放任他们",
            "value": "e"
        },
        {
            "name": "我常常“考察”所爱的人，想确定他们是否爱我",
            "value": "b"
        }
    ],
    [
        {
            "name": "组织资源并促使某些事情的发生是我的优势之一",
            "value": "g"
        },
        {
            "name": "提出新观点并同时振奋人心，这是我的优势之一",
            "value": "i"
        }
    ],
    [
        {
            "name": "当别人不是很欣赏我为他们所做的事情时我会很生气",
            "value": "f"
        },
        {
            "name": "当别人不听我说时我会很生气",
            "value": "d"
        }
    ],
    [
        {
            "name": "当别人不是很欣赏我为他们所做的事情时我会很生气",
            "value": "f"
        },
        {
            "name": "当别人不听我说时我会很生气",
            "value": "d"
        }
    ],
    [
        {
            "name": "当别人不是很欣赏我为他们所做的事情时我会很生气",
            "value": "f"
        },
        {
            "name": "当别人不听我说时我会很生气",
            "value": "d"
        }
    ],
    [
        {
            "name": "当别人不是很欣赏我为他们所做的事情时我会很生气",
            "value": "f"
        },
        {
            "name": "当别人不听我说时我会很生气",
            "value": "d"
        }
    ],
    [
        {
            "name": "当别人不是很欣赏我为他们所做的事情时我会很生气",
            "value": "f"
        },
        {
            "name": "当别人不听我说时我会很生气",
            "value": "d"
        }
    ]
]