[
    [
        {
            "name": "我浪漫并富于幻想",
            "value": "e"
        },
        {
            "name": "我很实际并实事求是",
            "value": "b"
        }
    ],
    [
        {
            "name": "我倾向于接受冲突",
            "value": "g"
        },
        {
            "name": "我倾向于避免冲突",
            "value": "a"
        }
    ],
    [
        {
            "name": "我一般是老练的、有魅力的以及有上进心",
            "value": "c"
        },
        {
            "name": "我一般是直率的、刻板的以及空想的",
            "value": "e"
        }
    ],
    [
        {
            "name": "我倾向于集中注意某一事物时，容易紧张",
            "value": "h"
        },
        {
            "name": "我倾向于自然的东西，喜欢开玩笑",
            "value": "i"
        }
    ],
    [
        {
            "name": "我待人友好，愿意结交新朋友",
            "value": "f"
        },
        {
            "name": "我喜欢独处，不太愿意与人交往",
            "value": "e"
        }
    ],
    [
        {
            "name": "我很难放松和停止思考潜在的问题",
            "value": "b"
        },
        {
            "name": "潜在的问题不会影响我的工作",
            "value": "a"
        }
    ],
    [
        {
            "name": "我是“聪明”的生存者",
            "value": "g"
        },
        {
            "name": "我是“高尚”的理想主义者",
            "value": "d"
        }
    ],
    [
        {
            "name": "我需要给别人爱",
            "value": "e"
        },
        {
            "name": "我倾向于避免冲突",
            "value": "a"
        }
    ],
    [
        {
            "name": "我倾向于接受冲突",
            "value": "g"
        },
        {
            "name": "我倾向于避免冲突",
            "value": "a"
        }
    ],
    [
        {
            "name": "我倾向于接受冲突",
            "value": "g"
        },
        {
            "name": "我倾向于避免冲突",
            "value": "a"
        }
    ],
    [
        {
            "name": "我倾向于接受冲突",
            "value": "g"
        },
        {
            "name": "我倾向于避免冲突",
            "value": "a"
        }
    ],
    [
        {
            "name": "我倾向于接受冲突",
            "value": "g"
        },
        {
            "name": "我倾向于避免冲突",
            "value": "a"
        }
    ],
    [
        {
            "name": "我倾向于接受冲突",
            "value": "g"
        },
        {
            "name": "我倾向于避免冲突",
            "value": "a"
        }
    ],
    [
        {
            "name": "我倾向于接受冲突",
            "value": "g"
        },
        {
            "name": "我倾向于避免冲突",
            "value": "a"
        }
    ],
    [
        {
            "name": "我倾向于接受冲突",
            "value": "g"
        },
        {
            "name": "我倾向于避免冲突",
            "value": "a"
        }
    ],
    [
        {
            "name": "我倾向于接受冲突",
            "value": "g"
        },
        {
            "name": "我倾向于避免冲突",
            "value": "a"
        }
    ],
    [
        {
            "name": "我倾向于接受冲突",
            "value": "g"
        },
        {
            "name": "我倾向于避免冲突",
            "value": "a"
        }
    ],
    [
        {
            "name": "我倾向于接受冲突",
            "value": "g"
        },
        {
            "name": "我倾向于避免冲突",
            "value": "a"
        }
    ],
    [
        {
            "name": "我倾向于接受冲突",
            "value": "g"
        },
        {
            "name": "我倾向于避免冲突",
            "value": "a"
        }
    ],
    [
        {
            "name": "我倾向于接受冲突",
            "value": "g"
        },
        {
            "name": "我倾向于避免冲突",
            "value": "a"
        }
    ]
]