 var datas=
[
    [
        {
            "name": "我浪漫并富于幻想",
            "value": "e"
        },
        {
            "name": "我很实际并实事求是",
            "value": "b"
        }
    ],
    [
        {
            "name": "我倾向于接受冲突",
            "value": "g"
        },
        {
            "name": "我倾向于避免冲突",
            "value": "a"
        }
    ],
    [
        {
            "name": "我一般是老练的、有魅力的以及有上进心",
            "value": "c"
        },
        {
            "name": "我一般是直率的、刻板的以及空想的",
            "value": "e"
        }
    ],
    [
        {
            "name": "我倾向于集中注意某一事物时，容易紧张",
            "value": "h"
        },
        {
            "name": "我倾向于自然的东西，喜欢开玩笑",
            "value": "i"
        }
    ],
    [
        {
            "name": "我待人友好，愿意结交新朋友",
            "value": "f"
        },
        {
            "name": "我喜欢独处，不太愿意与人交往",
            "value": "e"
        }
    ],
    [
        {
            "name": "我很难放松和停止思考潜在的问题",
            "value": "b"
        },
        {
            "name": "潜在的问题不会影响我的工作",
            "value": "a"
        }
    ],
    [
        {
            "name": "我是“聪明”的生存者",
            "value": "g"
        },
        {
            "name": "我是“高尚”的理想主义者",
            "value": "d"
        }
    ],
    [
        {
            "name": "我需要给别人爱",
            "value": "e"
        },
        {
            "name": "我愿意与别人保持一定的距离",
            "value": "g"
        }
    ],
    [
        {
            "name": "当别人给我一项新任务时，我通常会问自己它是否对我有用",
            "value": "c"
        },
        {
            "name": "当别人给我一项新任务时，我通常会问自己是否有兴趣",
            "value": "i"
        }
    ],
    [
        {
            "name": "我倾向于关注自己",
            "value": "e"
        },
        {
            "name": "我倾向于关注他人",
            "value": "a"
        }
    ],
    [
        {
            "name": "别人依赖我的见识与知识",
            "value": "h"
        },
        {
            "name": "别人依赖我的力量与决策",
            "value": "g"
        }
    ],
    [
        {
            "name": "我给人的印象是十分不自信的",
            "value": "b"
        },
        {
            "name": "我给人的印象是十分自信的",
            "value": "d"
        }
    ],
    [
        {
            "name": "我更加注重关系",
            "value": "f"
        },
        {
            "name": "我更加注意目的",
            "value": "c"
        }
    ],
    [
        {
            "name": "我不能大胆地说出自己想说的话",
            "value": "e"
        },
        {
            "name": "我能大胆地说出别人想说但没敢说的话",
            "value": "i"
        }
    ],
    [
        {
            "name": "不考虑其他选择而做某一确定的事对我来说是很困难的",
            "value": "h"
        },
        {
            "name": "放松、更具灵活性对我来说是很困难的",
            "value": "d"
        }
    ],
    [
        {
            "name": "我一般犹豫与拖延",
            "value": "b"
        },
        {
            "name": "我一般大胆与果断",
            "value": "g"
        }
    ],
    [
        {
            "name": "我不愿意别人给我带来麻烦",
            "value": "a"
        },
        {
            "name": "我被别人依赖，让我帮忙解决麻烦",
            "value": "f"
        }
    ],
    [
        {
            "name": "通常我会为了完成工作将感情置之不顾",
            "value": "c"
        },
        {
            "name": "在做事之前我需要克制自己的感情",
            "value": "e"
        }
    ],
    [
        {
            "name": "我一般是讲求方法并且很谨慎的",
            "value": "b"
        },
        {
            "name": "我一般是敢于冒险的",
            "value": "e"
        }
    ],
    [
        {
            "name": "我倾向于帮助和给予，喜欢与他人在一起",
            "value": "f"
        },
        {
            "name": "我倾向于严肃与缄默，喜欢讨论问题",
            "value": "d"
        }
    ],
    [
        {
            "name": "我常常感到自己需要成为顶梁柱",
            "value": "g"
        },
        {
            "name": "我常常感到自己需要做的十全十美",
            "value": "c"
        }
    ],
    [
        {
            "name": "我喜欢问难题和保持独立性",
            "value": "g"
        },
        {
            "name": "我喜欢保持心理的稳定与平静",
            "value": "a"
        }
    ],
    [
        {
            "name": "我太顽固并保持怀疑的态度",
            "value": "b"
        },
        {
            "name": "我太软心肠并多愁善感",
            "value": "f"
        }
    ],
    [
        {
            "name": "我常常担心自己不能得到较好的东西",
            "value": "i"
        },
        {
            "name": "我常常担心如果自己放松警惕，别人就会欺骗我",
            "value": "g"
        }
    ],
    [
        {
            "name": "我习惯性表现得很冷淡而使别人生气",
            "value": "e"
        },
        {
            "name": "我习惯性指使别人做事而使他们生气",
            "value": "d"
        }
    ],
    [
        {
            "name": "如果有太多的刺激和鼓舞，我会感到忧虑",
            "value": "a"
        },
        {
            "name": "如果没有太多的刺激和鼓舞，我会感到忧虑",
            "value": "i"
        }
    ],
    [
        {
            "name": "我要依靠朋友，同时他们也可以依靠我",
            "value": "b"
        },
        {
            "name": "我不依靠别人独立行事",
            "value": "c"
        }
    ],
    [
        {
            "name": "我一般独立于专心",
            "value": "h"
        },
        {
            "name": "我一般情绪化并热衷于自己的想法",
            "value": "e"
        }
    ],
    [
        {
            "name": "我喜欢向别人提出挑战，使他们振奋起来",
            "value": "g"
        },
        {
            "name": "我一般是敢于冒险的",
            "value": "f"
        }
    ],
    [
        {
            "name": "我总的来说是个开朗并喜欢交际的人",
            "value": "i"
        },
        {
            "name": "我总的来说是个认真并能很自律的人",
            "value": "d"
        }
    ],
    [
        {
            "name": "我希望能迎合别人-当别人距离很远，我就会感到不舒服",
            "value": "a"
        },
        {
            "name": "我希望与众不同-当不能看到别人与自己的区别，我就感到不舒服",
            "value": "c"
        }
    ],
    [
        {
            "name": "对我来说，追求个人的兴趣比追求舒适与安全更重要",
            "value": "h"
        },
        {
            "name": "对我来说，追求舒适比追求个人的兴趣更为重要",
            "value": "b"
        }
    ],
    [
        {
            "name": "当与他人有冲突时，我倾向于退缩",
            "value": "e"
        },
        {
            "name": "当与他人有冲突时，我很少会改变自己的态度",
            "value": "g"
        }
    ],
    [
        {
            "name": "我很容易屈服并受他人摆布",
            "value": "a"
        },
        {
            "name": "我对他人不但不作出让步，而且还对他们下达命令",
            "value": "d"
        }
    ],
    [
        {
            "name": "我很赏识自己高昂的精神状态与深沉",
            "value": "i"
        },
        {
            "name": "我很赏识自己对他人深沉的关心与热情",
            "value": "f"
        }
    ],
    [
        {
            "name": "我很想给别人留下好的印象",
            "value": "c"
        },
        {
            "name": "我并不在乎要给别人留下好的印象",
            "value": "h"
        }
    ],
    [
        {
            "name": "我依赖自己的毅力与常有的感觉",
            "value": "b"
        },
        {
            "name": "我依赖自己的想象与瞬间的灵感",
            "value": "e"
        }
    ],
    [
        {
            "name": "总的来说，我是很随和和很可爱的",
            "value": "a"
        },
        {
            "name": "总的来说，我是精力旺盛和过分自信的",
            "value": "g"
        }
    ],
    [
        {
            "name": "我努力工作以得到别人的接受与喜欢",
            "value": "c"
        },
        {
            "name": "能否得到别人的接受与喜欢对我来说并不重要",
            "value": "d"
        }
    ],
    [
        {
            "name": "当别人给我压力时我更容易退缩",
            "value": "h"
        },
        {
            "name": "当别人给我压力时我会变得更加自信",
            "value": "i"
        }
    ],
    [
        {
            "name": "人们对我感兴趣是因为我很开朗，有吸引力，有趣",
            "value": "f"
        },
        {
            "name": "人们对我感兴趣是因为我很安静，不同寻常，深沉",
            "value": "e"
        }
    ],
    [
        {
            "name": "职责与责任对我来说很重要",
            "value": "b"
        },
        {
            "name": "协调与认可对我来说很重要",
            "value": "a"
        }
    ],
    [
        {
            "name": "我制定出重要的计划并作出承诺以此鼓励人们",
            "value": "g"
        },
        {
            "name": "我指出不按照我们的建议去做所产生的后果，以此来要求人们顺从",
            "value": "d"
        }
    ],
    [
        {
            "name": "我很少表露情绪",
            "value": "h"
        },
        {
            "name": "我经常表露情绪",
            "value": "f"
        }
    ],
    [
        {
            "name": "我不擅长处理琐碎的事",
            "value": "i"
        },
        {
            "name": "我擅长处理琐碎的事",
            "value": "c"
        }
    ],
    [
        {
            "name": "我常常强调自己与绝大多数人的不同之处，尤其是家境的不同之处",
            "value": "e"
        },
        {
            "name": "我常常强调与绝大多数人的共同之处，尤其是家境的共同之处",
            "value": "a"
        }
    ],
    [
        {
            "name": "当场面变得热闹起来时，我倾向于站在一旁",
            "value": "h"
        },
        {
            "name": "当场面变得热闹起来时，我倾向于加入其中",
            "value": "g"
        }
    ],
    [
        {
            "name": "即使朋友不对，我也会支持他们",
            "value": "b"
        },
        {
            "name": "我不想为了友情对正确的事情作妥协",
            "value": "d"
        }
    ],
    [
        {
            "name": "我是一个善意的支持者",
            "value": "f"
        },
        {
            "name": "我是一个积极的老手",
            "value": "c"
        }
    ],
    [
        {
            "name": "当遇到困难时我倾向于夸大我的问题",
            "value": "e"
        },
        {
            "name": "当遇到困难时我倾向于转移注意力",
            "value": "i"
        }
    ],
    [
        {
            "name": "总的来说，我很确信知道情况应该如何",
            "value": "d"
        },
        {
            "name": "总的来说，我对情况持怀疑的态度",
            "value": "h"
        }
    ],
    [
        {
            "name": "我的悲观、抱怨会给别人带来麻烦",
            "value": "b"
        },
        {
            "name": "我的老板式的、控制的方式会给别人带来麻烦",
            "value": "g"
        }
    ],
    [
        {
            "name": "我倾向于按我的感觉办事并听之任之",
            "value": "f"
        },
        {
            "name": "我倾向于不按照我的感觉办事以免产生更多的问题",
            "value": "a"
        }
    ],
    [
        {
            "name": "通常我成为注意的焦点时，会很自然",
            "value": "c"
        },
        {
            "name": "通常我成为注意的焦点时，会很不习惯",
            "value": "e"
        }
    ],
    [
        {
            "name": "我做事情很谨慎，努力为意料之外的事情做准备",
            "value": "b"
        },
        {
            "name": "我做事情凭一时冲动，只是在问题出现时才临时准备",
            "value": "i"
        }
    ],
    [
        {
            "name": "当别人不是很欣赏我为他们所做的事情时我会很生气",
            "value": "f"
        },
        {
            "name": "当别人不听我说时我会很生气",
            "value": "d"
        }
    ],
    [
        {
            "name": "独立、自立更生对我很重要",
            "value": "g"
        },
        {
            "name": "有价值、得到别人的称赞对我很重要",
            "value": "c"
        }
    ],
    [
        {
            "name": "当与朋友争论时我倾向于强烈地坚持自己的观点",
            "value": "h"
        },
        {
            "name": "当与朋友争论时我倾向于顺其自然以免伤了和气",
            "value": "a"
        }
    ],
    [
        {
            "name": "我常常占有所爱的人——我不能放任他们",
            "value": "e"
        },
        {
            "name": "我常常“考察”所爱的人，想确定他们是否爱我",
            "value": "b"
        }
    ],
    [
        {
            "name": "组织资源并促使某些事情的发生是我的优势之一",
            "value": "g"
        },
        {
            "name": "提出新观点并同时振奋人心，这是我的优势之一",
            "value": "i"
        }
    ],
    [
        {
            "name": "我要在别人的驱策下才会做事，不能依赖自己",
            "value": "d"
        },
        {
            "name": "我过于情绪化，不能自律",
            "value": "e"
        }
    ],
    [
        {
            "name": "我试图使生活高节奏、紧张并充满兴奋的感觉",
            "value": "i"
        },
        {
            "name": "我试图使生活有规律、稳定、宁静",
            "value": "a"
        }
    ],
    [
        {
            "name": "尽管我已取得成功，我仍怀疑自己的能力",
            "value": "b"
        },
        {
            "name": "尽管我受到挫折，但我仍相信自己的能力",
            "value": "c"
        }
    ],
    [
        {
            "name": "一般我倾向于详细研究自己的情感并保持此情感很久",
            "value": "e"
        },
        {
            "name": "一般我倾向于减少自己的情感并不加以注意",
            "value": "h"
        }
    ],
    [
        {
            "name": "我对许多人加以注意并培养他们",
            "value": "f"
        },
        {
            "name": "我指导许多人并鼓励他们",
            "value": "c"
        }
    ],
    [
        {
            "name": "我对自己要求有点严格",
            "value": "d"
        },
        {
            "name": "我对自己有点宽容",
            "value": "i"
        }
    ],
    [
        {
            "name": "我倾向于独断，并追求卓越",
            "value": "c"
        },
        {
            "name": "我谦虚，喜欢按自己的节奏做事",
            "value": "a"
        }
    ],
    [
        {
            "name": "我为自己的清晰性与目标性感到自豪",
            "value": "h"
        },
        {
            "name": "我为自己的可靠性与诚实而感到自豪",
            "value": "b"
        }
    ],
    [
        {
            "name": "我花大量的时间反省——理解自己的感受对我来说是很重要的",
            "value": "e"
        },
        {
            "name": "我花大量的时间反省——做完事情对我来说是很重要的",
            "value": "g"
        }
    ],
    [
        {
            "name": "总的来说我认为自己是一个灿烂的随和的人",
            "value": "a"
        },
        {
            "name": "总的来说我是一个严肃的、有品位的人",
            "value": "d"
        }
    ],
    [
        {
            "name": "我头脑灵活，精力充沛",
            "value": "i"
        },
        {
            "name": "我有一颗赤热的心，具有奉献精神",
            "value": "f"
        }
    ],
    [
        {
            "name": "我所做的事情要有极大的可能性得到奖励与赏识",
            "value": "c"
        },
        {
            "name": "如果所做的事是我所感兴趣的，我愿意放弃自己的奖励与赏识",
            "value": "h"
        }
    ],
    [
        {
            "name": "我认为履行社会义务并不重要",
            "value": "d"
        },
        {
            "name": "我常常认真地履行我的社会义务",
            "value": "b"
        }
    ],
    [
        {
            "name": "在绝大多数情况下，我愿意做领导",
            "value": "g"
        },
        {
            "name": "在绝大多数情况下，我愿意让其他人做领导",
            "value": "a"
        }
    ],
    [
        {
            "name": "多年以来，我的价值观与生活方式变化了好几次",
            "value": "d"
        },
        {
            "name": "多年以来，我的价值观与生活方式基本没有变化",
            "value": "b"
        }
    ],
    [
        {
            "name": "一般我缺乏自律能力",
            "value": "i"
        },
        {
            "name": "一般我与别人的联系很少",
            "value": "h"
        }
    ],
    [
        {
            "name": "我倾向于拒绝给予爱，希望别人进入我的世界",
            "value": "e"
        },
        {
            "name": "我倾向于过于直率地给别人爱，希望自己进入到别人的世界",
            "value": "f"
        }
    ],
    [
        {
            "name": "我倾向于作最坏的打算",
            "value": "b"
        },
        {
            "name": "我倾向于认为任何事情都会变得最好",
            "value": "a"
        }
    ],
    [
        {
            "name": "人们相信我是因为我很自信并且尽全力做的最好",
            "value": "d"
        },
        {
            "name": "人们相信我是因为我很公正会正确地做事",
            "value": "b"
        }
    ],
    [
        {
            "name": "我常常忙于自己的事情而忽略了与他人的交往",
            "value": "h"
        },
        {
            "name": "我常常忙于与他人交往而忽略了自己的事情",
            "value": "e"
        }
    ],
    [
        {
            "name": "当第一次遇到某人时，通常我会镇定自若并沉默寡言",
            "value": "c"
        },
        {
            "name": "当第一次遇到某人时，通常我会闲聊并使人觉得有趣",
            "value": "i"
        }
    ],
    [
        {
            "name": "总而言之，我是很悲观的",
            "value": "a"
        },
        {
            "name": "总而言之，我是很乐观的",
            "value": "e"
        }
    ],
    [
        {
            "name": "我更喜欢呆在自己的小世界里",
            "value": "h"
        },
        {
            "name": "我更喜欢让全世界的人知道我的所在",
            "value": "g"
        }
    ],
    [
        {
            "name": "我常常被紧张、不安全与怀疑而困扰",
            "value": "b"
        },
        {
            "name": "我常常被生气、完美主义与不耐烦而困扰",
            "value": "d"
        }
    ],
    [
        {
            "name": "我意识到我是太有人情味与待人太亲密",
            "value": "f"
        },
        {
            "name": "我意识到我是太酷过于冷漠",
            "value": "c"
        }
    ],
    [
        {
            "name": "我失败是因为我不能抓住机会",
            "value": "e"
        },
        {
            "name": "我失败是因为我追求太多的可能性",
            "value": "i"
        }
    ],
    [
        {
            "name": "我要过很长的时间后才会采取行动",
            "value": "h"
        },
        {
            "name": "我会立即采取行动",
            "value": "d"
        }
    ],
    [
        {
            "name": "通常我很难作出决定",
            "value": "b"
        },
        {
            "name": "我很少会感到难作出决定",
            "value": "g"
        }
    ],
    [
        {
            "name": "我倾向于给人留下态度强硬的印象",
            "value": "f"
        },
        {
            "name": "我并不倾向于过多地坚持自己的意见",
            "value": "a"
        }
    ],
    [
        {
            "name": "我情绪稳定",
            "value": "c"
        },
        {
            "name": "我情绪多变",
            "value": "e"
        }
    ],
    [
        {
            "name": "当不知道要干什么事情时，我常常会向别人寻求建议",
            "value": "b"
        },
        {
            "name": "当不知道要干什么事情时，我会尝试不同的事情以确定哪一种最适合我去做",
            "value": "i"
        }
    ],
    [
        {
            "name": "我担心，别人搞活动时会忘记我",
            "value": "f"
        },
        {
            "name": "我担心，参加别人活动会影响我做自己的事情",
            "value": "d"
        }
    ],
    [
        {
            "name": "当我生气时，一般我会责备别人",
            "value": "g"
        },
        {
            "name": "当我生气时，一般我会变得很冷淡",
            "value": "c"
        }
    ],
    [
        {
            "name": "我很难入睡",
            "value": "h"
        },
        {
            "name": "我很快就能入睡",
            "value": "a"
        }
    ],
    [
        {
            "name": "我常常努力地思考如何与别人产生更为亲密的关系",
            "value": "f"
        },
        {
            "name": "我常常努力地思考别人想从我这儿得到什么",
            "value": "b"
        }
    ],
    [
        {
            "name": "通常我是慎重的、有话直说的并且深思熟虑的人",
            "value": "g"
        },
        {
            "name": "通常我是易兴奋的、善于快速地说话以回避问题并且机智的人",
            "value": "i"
        }
    ],
    [
        {
            "name": "当看到别人犯错误时，我常常不说出口",
            "value": "e"
        },
        {
            "name": "当看到别人犯错误时，我常常会帮助他们认识到所犯的错误",
            "value": "d"
        }
    ],
    [
        {
            "name": "在生活中的绝大多数时间里，我是情感激烈的人，会产生许多易变的情感",
            "value": "i"
        },
        {
            "name": "在生活中的绝大多数时间里，我是很稳定的人，我会“心如止水”",
            "value": "a"
        }
    ],
    [
        {
            "name": "当我不喜欢某些人时，我会掩藏自己的情感而努力地保持热情",
            "value": "c"
        },
        {
            "name": "当我不喜欢某些人时，我会以这种或那种方式让他们知道我的情感",
            "value": "b"
        }
    ],
    [
        {
            "name": "我与别人交往有困难是因为我很敏感并总是从自己的角度考虑事情",
            "value": "e"
        },
        {
            "name": "我与别人交往有困难是因为我不太在乎社会习俗",
            "value": "h"
        }
    ],
    [
        {
            "name": "我的方法是直接帮助别人",
            "value": "f"
        },
        {
            "name": "我的方法是告诉别人如何自助",
            "value": "g"
        }
    ],
    [
        {
            "name": "总的来说，我喜欢“释放”并突破所受的限制",
            "value": "i"
        },
        {
            "name": "总的来说，我不喜欢过多地失去自我控制",
            "value": "d"
        }
    ],
    [
        {
            "name": "我过度地关注于要比别人做得好",
            "value": "c"
        },
        {
            "name": "我过度地关注于把别人的事做好就行",
            "value": "a"
        }
    ],
    [
        {
            "name": "我的想法总是很玄想的——包含着想象与好奇",
            "value": "h"
        },
        {
            "name": "我的想法总是很实际的——只是试图保持事情的发展状况",
            "value": "b"
        }
    ],
    [
        {
            "name": "我的主要优势之一就是我能够控制场面",
            "value": "g"
        },
        {
            "name": "我的主要优势之一就是我能够讲述内心的感受",
            "value": "e"
        }
    ],
    [
        {
            "name": "我努力争取做好事情而不管这样会使别人不开心",
            "value": "d"
        },
        {
            "name": "我不喜欢有压力的感觉，所以也不喜欢压制别人",
            "value": "a"
        }
    ],
    [
        {
            "name": "我常常感到骄傲因为我对别人的生活中起着重要的作用",
            "value": "f"
        },
        {
            "name": "我常常感到骄傲因为我对新的经历会很感兴趣并且乐于接受",
            "value": "i"
        }
    ],
    [
        {
            "name": "我认为我给别人留下的印象是好样的甚至很令人钦佩",
            "value": "c"
        },
        {
            "name": "我认为我给别人留下的印象是与众不同的甚至很古怪",
            "value": "h"
        }
    ],
    [
        {
            "name": "一般我做我必须去做的事",
            "value": "b"
        },
        {
            "name": "一般我做我想做的事",
            "value": "e"
        }
    ],
    [
        {
            "name": "我很喜欢处于高度的压力之下甚至是困难的情景中",
            "value": "g"
        },
        {
            "name": "我不喜欢处于高度的压力之下甚至是困难的情景中",
            "value": "a"
        }
    ],
    [
        {
            "name": "我为自己的灵活能力感到骄傲——我知道合适的或重要的情况是变化的",
            "value": "c"
        },
        {
            "name": "我为自己的立场感到骄傲——我有坚定的信念",
            "value": "d"
        }
    ],
    [
        {
            "name": "我的风格倾向于节约而朴实",
            "value": "h"
        },
        {
            "name": "我的风格倾向于过度并过量地做某些事情",
            "value": "i"
        }
    ],
    [
        {
            "name": "我的健康与幸福受到伤害因为我有强烈的愿望去帮助别人",
            "value": "f"
        },
        {
            "name": "我的人际关系受到损害因为我只关注与自己的需要",
            "value": "e"
        }
    ],
    [
        {
            "name": "总的来说，我太坦诚太天真",
            "value": "a"
        },
        {
            "name": "总的来说，我过于谨慎过于戒备",
            "value": "b"
        }
    ],
    [
        {
            "name": "有时我因过于好斗而令人厌恶",
            "value": "g"
        },
        {
            "name": "有时我因太紧张而令人厌恶",
            "value": "d"
        }
    ],
    [
        {
            "name": "关心别人的需要并提供服务对我来说是很重要的",
            "value": "f"
        },
        {
            "name": "寻找看待并做好事情的其他方法对我来说是很重要的",
            "value": "h"
        }
    ],
    [
        {
            "name": "我全身心地持之以恒地追求我的目标",
            "value": "c"
        },
        {
            "name": "我喜欢探索各种行动的途径，想看看最终的结果如何",
            "value": "i"
        }
    ],
    [
        {
            "name": "我经常会激起强烈与紧张的情绪",
            "value": "e"
        },
        {
            "name": "我经常使自己冷静与安逸",
            "value": "a"
        }
    ],
    [
        {
            "name": "我不太注重实际的结果，而注重自己的兴趣",
            "value": "h"
        },
        {
            "name": "我很实际并希望我的工作有具体的结果",
            "value": "g"
        }
    ],
    [
        {
            "name": "我有强烈的归属需要",
            "value": "b"
        },
        {
            "name": "我有强烈的平衡需要",
            "value": "d"
        }
    ],
    [
        {
            "name": "过去我可能过于要求朋友间的亲密",
            "value": "f"
        },
        {
            "name": "过去我可能过于要求朋友间的疏远",
            "value": "c"
        }
    ],
    [
        {
            "name": "我倾向于回忆过去的事情",
            "value": "d"
        },
        {
            "name": "我倾向于预期未来所要做的事情",
            "value": "i"
        }
    ],
    [
        {
            "name": "我倾向于将人看作是很麻烦的、苛刻的",
            "value": "h"
        },
        {
            "name": "我倾向于将人看作是很莽撞的，和有需求的",
            "value": "d"
        }
    ],
    [
        {
            "name": "总的来说，我不太自信",
            "value": "b"
        },
        {
            "name": "总的来说，我仅相信自己",
            "value": "g"
        }
    ],
    [
        {
            "name": "我可能太被动，不积极参与",
            "value": "a"
        },
        {
            "name": "我可能控制过多",
            "value": "f"
        }
    ],
    [
        {
            "name": "我经常因为怀疑自己而停下来",
            "value": "e"
        },
        {
            "name": "我很少会怀疑自己",
            "value": "c"
        }
    ],
    [
        {
            "name": "如果让我在熟悉的东西与新的东西之间作出选择，我会选新的东西",
            "value": "i"
        },
        {
            "name": "我一般会选我所喜欢的东西：会对我所不喜欢的东西而感到失望",
            "value": "b"
        }
    ],
    [
        {
            "name": "我给别人大量的身体接触以使他们相信我对他们的爱",
            "value": "f"
        },
        {
            "name": "我认为真正的爱是不需要身体的接触",
            "value": "d"
        }
    ],
    [
        {
            "name": "当我需要责备别人时，我是很严厉很直截了当的",
            "value": "g"
        },
        {
            "name": "当我需要责备别人时，我常常是旁敲侧击的",
            "value": "c"
        }
    ],
    [
        {
            "name": "我对别人认为很困扰甚至很可怕的学科却很感兴趣",
            "value": "h"
        },
        {
            "name": "我不喜欢去研究令人困扰的、可怕的学科",
            "value": "a"
        }
    ],
    [
        {
            "name": "我给别人大量的身体接触以使他们相信我对他们的爱",
            "value": "f"
        },
        {
            "name": "我认为真正的爱是不需要身体的接触",
            "value": "d"
        }
    ],
    [
        {
            "name": "我因防碍、干扰别人，而受到指责",
            "value": "f"
        },
        {
            "name": "我因过于逃避、沉默寡言而受到别人的指责",
            "value": "b"
        }
    ],
    [
        {
            "name": "我担心没有办法履行我的职责",
            "value": "g"
        },
        {
            "name": "我担心自己缺乏自律不能履行职责",
            "value": "i"
        }
    ],
    [
        {
            "name": "总的来说我是一个很凭直觉办事并且极度个人主义的人",
            "value": "e"
        },
        {
            "name": "总的来说我是一个很有组织的并且负责任的人",
            "value": "d"
        }
    ],
    [
        {
            "name": "克服惰性是我的主要问题之一",
            "value": "a"
        },
        {
            "name": "不能缓慢下来是我的主要问题之一",
            "value": "i"
        }
    ],
    [
        {
            "name": "当我觉得不安全时，我会变得傲慢，表示对此的轻视",
            "value": "c"
        },
        {
            "name": "当我觉得不安全时，我会自卫并变得好争论",
            "value": "b"
        }
    ],
    [
        {
            "name": "我是思想开明的，乐意尝试新的方法",
            "value": "h"
        },
        {
            "name": "我会表白真情，乐意与别人共享我的情感",
            "value": "e"
        }
    ],
    [
        {
            "name": "在别人面前我会表现得比实际的我更为强硬些",
            "value": "g"
        },
        {
            "name": "在别人面前我会表现得比实际的我更为在意些",
            "value": "f"
        }
    ],
    [
        {
            "name": "通常我是按我的良心与理性去做事情",
            "value": "d"
        },
        {
            "name": "通常我是按我的感觉与冲动去做事情",
            "value": "i"
        }
    ],
    [
        {
            "name": "严峻的逆境使我变得坚强",
            "value": "c"
        },
        {
            "name": "严峻的逆境使我变得气馁与听天由命",
            "value": "a"
        }
    ],
    [
        {
            "name": "我确信有某种“安全网”以依靠",
            "value": "h"
        },
        {
            "name": "我常常要选择居于边缘而无所依靠",
            "value": "b"
        }
    ],
    [
        {
            "name": "我要为了别人而表现得很坚强所以没有时间顾及自己的情感与忧虑",
            "value": "g"
        },
        {
            "name": "我不能应对自己的情感与忧虑，所以我不能为别人而表现得很坚强",
            "value": "e"
        }
    ],
    [
        {
            "name": "我常常觉得奇怪，生活中美好的事情很多为什么人们只看到消极的一面",
            "value": "a"
        },
        {
            "name": "我常常觉得奇怪，生活中很糟糕为什么人还这么开心",
            "value": "d"
        }
    ],
    [
        {
            "name": "我努力使自己不被看作为自私的人",
            "value": "f"
        },
        {
            "name": "我努力使自己不被看作为令人讨厌的人",
            "value": "i"
        }
    ],
    [
        {
            "name": "当我担心被别人的需要与要求压垮时我会避免产生亲密的关系",
            "value": "h"
        },
        {
            "name": "当我担心会辜负人们对我的期望时，我会避免产生亲密的关系",
            "value": "c"
        }
    ]
]